Tekla.Structures.Dialog.UIControls.WpfShapeCatalog
The WpfShapeCatalog class represents a group of controls to select shapes
using the shape catalog.
WpfShapeCatalog

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.shapeSelectionForm
Shape form.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.shapeList
Shape list.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.startShape
Start shape.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.#ctor
Initializes a new instance of the ShapeCatalog class.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.#ctor(System.String)
Initializes a new instance of the ShapeCatalog class and will select
the Shape (if available) in the tree.
shape: The Shape to be selected in the dialog.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object) method of
the Tekla.Structures.Dialog.FormBase class.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.SelectedShape
Gets or sets the selected Shape in the control.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.ButtonWidth
Gets and sets the width of the button control.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.ButtonHeight
Gets and sets the height of the button control.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.ShapeSelectionForm
Gets or sets shape form.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.ShapeList
Gets or sets shape list.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.button_Loaded(System.Object,System.Windows.RoutedEventArgs)
When the load event is raised, the control begins to enumerate through the shape
catalog.
sender: The event sender.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.OnValueChanged(System.Object)
Event handler for passing generic catalog data back to dialog
data: value data

Tekla.Structures.Dialog.UIControls.WpfShapeCatalog.InitializeComponent
InitializeComponent